import numpy as np
import pandas as pd
from com_cheese_api.util.file import FileReader

from konlpy.tag import Okt
from collections import Counter
from wordcloud import WordCloud
import matplotlib.pyplot as plt

from sklearn.model_selection import train_test_split

import os

# 1. 데이터 추출

# ==============================================================
# ====================                     =====================
# ====================          KDD        =====================
# ====================                     =====================
# ==============================================================

class UserKdd():
    ...

    



# 2. 전처리 (Df로 전환) -> processing에 결과는 DF

# ==============================================================
# ====================                     =====================
# ====================    Preprocessing    =====================
# ====================                     =====================
# ==============================================================

class UserDf():
    def __init__(self):
        self.fileReader = FileReader()
        self.data = os.path.join(os.path.abspath(os.path.dirname(__file__))+'/data')
        self.odf = None

    




# 3. 모델링 (Dto)

# ==============================================================
# =======================                =======================
# =======================    Modeling    =======================
# =======================                =======================
# ==============================================================

class UserDto():
    ...

# Json 형태로 쓰기 위해 씀!
class UserVo():
    ...


# 텐서플로우가 걸리는 곳
class UserTf():
    ...

# 인공지능 판단해주는 곳
class UserAi():
    ...

# 4. 프론트에 데이터 보내주는 행위 (프론트에서 이 내용이 보임!!)

# ==============================================================
# =====================                  =======================
# =====================    Resourcing    =======================
# =====================                  =======================
# ==============================================================

class User():
    ...